; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_20_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 - counter
	)
  (:init
		(= (value c0) 9)
	(= (value c1) 2)
	(= (value c2) 85)
	(= (value c3) 22)
	(= (value c4) 38)
	(= (value c5) 90)
	(= (value c6) 37)
	(= (value c7) 71)
	(= (value c8) 70)
	(= (value c9) 83)
	(= (value c10) 54)
	(= (value c11) 59)
	(= (value c12) 49)
	(= (value c13) 30)
	(= (value c14) 3)
	(= (value c15) 99)
	(= (value c16) 99)
	(= (value c17) 76)
	(= (value c18) 100)
	(= (value c19) 8)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)
	(= (rate_value c19) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
	(<= (+ (value c18) 1) (value c19))
		)
	)
)

; plan
1. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 8 of 19
2. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 8 of 19
3. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 19
4. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 8 of 19
5. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 8 of 19
6. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 8 of 19
7. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 8 of 19
8. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 8 of 19
9. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 8 of 19
10. (decrement c15)
   changed: (value c15) from 99 to 98
   goals met: 9 of 19
11. (decrement_rate c13)
   changed: (rate_value c13) from 1 to 0
   goals met: 9 of 19
12. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 9 of 19
13. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 9 of 19
14. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 9 of 19
15. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 9 of 19
16. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 9 of 19
17. (increment c12)
   changed: (value c12) from 49 to 52
   goals met: 9 of 19
18. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 9 of 19
19. (increment c12)
   changed: (value c12) from 52 to 56
   goals met: 9 of 19
20. (increment c12)
   changed: (value c12) from 56 to 60
   goals met: 10 of 19
21. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 10 of 19
22. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 10 of 19
23. (increment c8)
   changed: (value c8) from 70 to 72
   goals met: 11 of 19
24. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 11 of 19
25. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 11 of 19
26. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 11 of 19
27. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 11 of 19
28. (increment c1)
   changed: (value c1) from 2 to 6
   goals met: 11 of 19
29. (increment c1)
   changed: (value c1) from 6 to 10
   goals met: 12 of 19
30. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 12 of 19
31. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 12 of 19
32. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 12 of 19
33. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 12 of 19
34. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 12 of 19
35. (increment c17)
   changed: (value c17) from 76 to 82
   goals met: 12 of 19
36. (increment c17)
   changed: (value c17) from 82 to 88
   goals met: 12 of 19
37. (increment c17)
   changed: (value c17) from 88 to 94
   goals met: 12 of 19
38. (increment c17)
   changed: (value c17) from 94 to 100
   goals met: 12 of 19
39. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 12 of 19
40. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 12 of 19
41. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 12 of 19
42. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 12 of 19
43. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 12 of 19
44. (decrement_rate c13)
   changed: (rate_value c13) from 1 to 0
   goals met: 12 of 19
45. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 12 of 19
46. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 12 of 19
47. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 12 of 19
48. (increment c14)
   changed: (value c14) from 3 to 10
   goals met: 12 of 19
49. (increment c14)
   changed: (value c14) from 10 to 17
   goals met: 12 of 19
50. (increment c14)
   changed: (value c14) from 17 to 24
   goals met: 12 of 19
51. (increment c14)
   changed: (value c14) from 24 to 31
   goals met: 13 of 19
52. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 13 of 19
53. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 13 of 19
54. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 13 of 19
55. (decrement c12)
   changed: (value c12) from 60 to 56
   goals met: 12 of 19
56. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 12 of 19
57. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 12 of 19
58. (increment c12)
   changed: (value c12) from 56 to 60
   goals met: 13 of 19
59. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 13 of 19
60. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 13 of 19
61. (increment c13)
   changed: (value c13) from 30 to 37
   goals met: 12 of 19
62. (increment c14)
   changed: (value c14) from 31 to 38
   goals met: 13 of 19
63. (increment c13)
   changed: (value c13) from 37 to 44
   goals met: 12 of 19
64. (increment c13)
   changed: (value c13) from 44 to 51
   goals met: 12 of 19
65. (increment c14)
   changed: (value c14) from 38 to 45
   goals met: 12 of 19
66. (increment c14)
   changed: (value c14) from 45 to 52
   goals met: 13 of 19
67. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 13 of 19
68. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 13 of 19
69. (increment c6)
   changed: (value c6) from 37 to 45
   goals met: 13 of 19
70. (increment c6)
   changed: (value c6) from 45 to 53
   goals met: 13 of 19
71. (increment c6)
   changed: (value c6) from 53 to 61
   goals met: 13 of 19
72. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 13 of 19
73. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 13 of 19
74. (increment c6)
   changed: (value c6) from 61 to 69
   goals met: 13 of 19
75. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 13 of 19
76. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 13 of 19
77. (increment c6)
   changed: (value c6) from 69 to 79
   goals met: 12 of 19
78. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 12 of 19
79. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 12 of 19
80. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 12 of 19
81. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 12 of 19
82. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 12 of 19
83. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 12 of 19
84. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 12 of 19
85. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 12 of 19
86. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 12 of 19
87. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 19
88. (increment c3)
   changed: (value c3) from 22 to 28
   goals met: 12 of 19
89. (increment c3)
   changed: (value c3) from 28 to 34
   goals met: 12 of 19
90. (increment c13)
   changed: (value c13) from 51 to 58
   goals met: 11 of 19
91. (increment c14)
   changed: (value c14) from 52 to 59
   goals met: 12 of 19
92. (increment c13)
   changed: (value c13) from 58 to 65
   goals met: 12 of 19
93. (increment c14)
   changed: (value c14) from 59 to 66
   goals met: 13 of 19
94. (increase_rate c19)
   changed: (rate_value c19) from 0 to 1
   goals met: 13 of 19
95. (increase_rate c19)
   changed: (rate_value c19) from 1 to 2
   goals met: 13 of 19
96. (increase_rate c19)
   changed: (rate_value c19) from 2 to 3
   goals met: 13 of 19
97. (increase_rate c19)
   changed: (rate_value c19) from 3 to 4
   goals met: 13 of 19
98. (increase_rate c19)
   changed: (rate_value c19) from 4 to 5
   goals met: 13 of 19
99. (increase_rate c19)
   changed: (rate_value c19) from 5 to 6
   goals met: 13 of 19
100. (increase_rate c19)
   changed: (rate_value c19) from 6 to 7
   goals met: 13 of 19
101. (increase_rate c19)
   changed: (rate_value c19) from 7 to 8
   goals met: 13 of 19
102. (increase_rate c19)
   changed: (rate_value c19) from 8 to 9
   goals met: 13 of 19
103. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 13 of 19
104. (increment c19)
   changed: (value c19) from 8 to 17
   goals met: 13 of 19
105. (increment c19)
   changed: (value c19) from 17 to 26
   goals met: 13 of 19
106. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 13 of 19
107. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 13 of 19
108. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 13 of 19
109. (increase_rate c19)
   changed: (rate_value c19) from 9 to 10
   goals met: 13 of 19
110. (increment c19)
   changed: (value c19) from 26 to 36
   goals met: 13 of 19
111. (increment c19)
   changed: (value c19) from 36 to 46
   goals met: 13 of 19
112. (increment c19)
   changed: (value c19) from 46 to 56
   goals met: 13 of 19
113. (increment c19)
   changed: (value c19) from 56 to 66
   goals met: 13 of 19
114. (increment c19)
   changed: (value c19) from 66 to 76
   goals met: 13 of 19
115. (increase_rate c18)
   changed: (rate_value c18) from 4 to 5
   goals met: 13 of 19
116. (increment c19)
   changed: (value c19) from 76 to 86
   goals met: 13 of 19
117. (increment c19)
   changed: (value c19) from 86 to 96
   goals met: 13 of 19
118. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 13 of 19
119. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 13 of 19
120. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 13 of 19
121. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 13 of 19
122. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 13 of 19
123. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 13 of 19
124. (increment c10)
   changed: (value c10) from 54 to 60
   goals met: 12 of 19
125. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 12 of 19
126. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 12 of 19
127. (increment c10)
   changed: (value c10) from 60 to 66
   goals met: 12 of 19
128. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 12 of 19
129. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 12 of 19
130. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 12 of 19
131. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 12 of 19
132. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 12 of 19
133. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 12 of 19
134. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 12 of 19
135. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 12 of 19
136. (decrement c9)
   changed: (value c9) from 83 to 79
   goals met: 12 of 19
137. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 12 of 19
138. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 12 of 19
139. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 12 of 19
140. (increment c3)
   changed: (value c3) from 34 to 43
   goals met: 11 of 19
141. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 11 of 19
142. (increment c3)
   changed: (value c3) from 43 to 53
   goals met: 11 of 19
143. (decrement c2)
   changed: (value c2) from 85 to 81
   goals met: 11 of 19
144. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 19
145. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 19
146. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 19
147. (increment c4)
   changed: (value c4) from 38 to 41
   goals met: 11 of 19
148. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 11 of 19
149. (decrement c2)
   changed: (value c2) from 81 to 76
   goals met: 11 of 19
150. (decrement c2)
   changed: (value c2) from 76 to 71
   goals met: 11 of 19
151. (decrement c2)
   changed: (value c2) from 71 to 66
   goals met: 11 of 19
152. (decrement c2)
   changed: (value c2) from 66 to 61
   goals met: 11 of 19
153. (decrement c2)
   changed: (value c2) from 61 to 56
   goals met: 11 of 19
154. (decrement c2)
   changed: (value c2) from 56 to 51
   goals met: 12 of 19
155. (increment c4)
   changed: (value c4) from 41 to 44
   goals met: 12 of 19
156. (decrement c3)
   changed: (value c3) from 53 to 43
   goals met: 12 of 19
157. (decrement c2)
   changed: (value c2) from 51 to 46
   goals met: 12 of 19
158. (decrement c2)
   changed: (value c2) from 46 to 41
   goals met: 13 of 19
159. (decrement c6)
   changed: (value c6) from 79 to 69
   goals met: 14 of 19
160. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 14 of 19
161. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 14 of 19
162. (decrement c5)
   changed: (value c5) from 90 to 86
   goals met: 14 of 19
163. (decrement c5)
   changed: (value c5) from 86 to 82
   goals met: 14 of 19
164. (increment c6)
   changed: (value c6) from 69 to 79
   goals met: 13 of 19
165. (decrement c5)
   changed: (value c5) from 82 to 78
   goals met: 14 of 19
166. (decrement c6)
   changed: (value c6) from 79 to 69
   goals met: 14 of 19
167. (decrement c5)
   changed: (value c5) from 78 to 74
   goals met: 14 of 19
168. (decrement c5)
   changed: (value c5) from 74 to 70
   goals met: 14 of 19
169. (decrement c5)
   changed: (value c5) from 70 to 66
   goals met: 15 of 19
170. (increment c10)
   changed: (value c10) from 66 to 76
   goals met: 15 of 19
171. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 15 of 19
172. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 15 of 19
173. (increment c11)
   changed: (value c11) from 59 to 63
   goals met: 14 of 19
174. (increment c12)
   changed: (value c12) from 60 to 64
   goals met: 15 of 19
175. (decrement c9)
   changed: (value c9) from 79 to 75
   goals met: 16 of 19
176. (decrement c17)
   changed: (value c17) from 100 to 94
   goals met: 16 of 19
177. (decrement c16)
   changed: (value c16) from 99 to 97
   goals met: 15 of 19
178. (decrement c16)
   changed: (value c16) from 97 to 95
   goals met: 15 of 19
179. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 15 of 19
180. (decrement c16)
   changed: (value c16) from 95 to 93
   goals met: 16 of 19
181. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 16 of 19
182. (decrement c15)
   changed: (value c15) from 98 to 95
   goals met: 16 of 19
183. (decrement c15)
   changed: (value c15) from 95 to 92
   goals met: 17 of 19
184. (decrement c18)
   changed: (value c18) from 100 to 95
   goals met: 18 of 19
185. (increment c11)
   changed: (value c11) from 63 to 67
   goals met: 17 of 19
186. (increment c12)
   changed: (value c12) from 64 to 68
   goals met: 17 of 19
187. (increment c13)
   changed: (value c13) from 65 to 72
   goals met: 17 of 19
188. (increment c14)
   changed: (value c14) from 66 to 73
   goals met: 18 of 19
189. (increment c11)
   changed: (value c11) from 67 to 71
   goals met: 17 of 19
190. (increment c12)
   changed: (value c12) from 68 to 72
   goals met: 17 of 19
191. (increment c13)
   changed: (value c13) from 72 to 79
   goals met: 17 of 19
192. (increment c14)
   changed: (value c14) from 73 to 80
   goals met: 18 of 19
193. (increment c11)
   changed: (value c11) from 71 to 75
   goals met: 17 of 19
194. (increment c12)
   changed: (value c12) from 72 to 76
   goals met: 18 of 19
195. (increment c11)
   changed: (value c11) from 75 to 79
   goals met: 18 of 19
196. (increment c12)
   changed: (value c12) from 76 to 80
   goals met: 18 of 19
197. (increment c13)
   changed: (value c13) from 79 to 86
   goals met: 18 of 19
198. (increment c14)
   changed: (value c14) from 80 to 87
   goals met: 19 of 19
